# %%%%%%%%%%%%%%  Bugs  %%%%%%%%%%%%%%%%%%
#
#
# 3）整体关于引用时候预览的问题：如果某个特征是引用的话，预览的时候不好处理，我们这么解决，如果该属性是引用，则预览的时候直接调用该属性的默认值（仅限预览的时候哈）
#
#
#
#
# # %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#
# 所有控件中涉及的File Name用相对路径（图片，声音等），即相对于程序保存目录的路径
#


# TODOLIST

# 1)
# 1）添加一个del快捷键删除structure 和Timeline中的widgets


# Silder：


""""



Cycle：

	1）去掉order里面的Offset选项

	2）No repeat After: （待定）
	3) 直接excel复制粘贴有点问题（windows 下）
	4）导入导出问题；
"""

# slide：

# 3）在cycle里面增加两个参数，也就是start 和end angle：（默认分别是0,360）,0 度对应是正上垂直线（+Y）。另外需要注意的默认是在不是全圆的扇形中，缺口的边框没有（也就是只有弧线）。
# 当然fill color的时候还是需要填充出一个扇形的。

# 4）另外在特征中，增加一个选项来决定是否呈现缺口的边框。

# 【冲突】6）另外，最好是选中后增加一个快捷键，按del 删除

